feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \brief Filter Type
 */
typedef enum
{
    IfxCan_FilterType_range,    /**< \brief Range filter from SF1ID to SF2ID (SF2ID is greater than SF1ID) */
    IfxCan_FilterType_dualId,   /**< \brief Dual ID filter for SF1ID or SF2ID */
    IfxCan_FilterType_classic,  /**< \brief Classic filter: SF1ID = filter, SF2ID = mask */
    IfxCan_FilterType_none      /**< \brief Reserved */
} IfxCan_FilterType;

/** \brief CAN Frame mode\n
 * Description in Ifx_CAN.N[x].CCCR.CME, (x= 0 to 3)
 */
typedef enum
{
    IfxCan_FrameMode_standard,      /**< \brief Standard CAN frame (transmit and receive) */
    IfxCan_FrameMode_fdLong,        /**< \brief CAN FD long frame in transmit and CAN FD long and fast frame in receive */
    IfxCan_FrameMode_fdLongAndFast  /**< \brief CAN FD long and fast frames (transmit and receive) */
} IfxCan_FrameMode;

/** \brief CAN frame type
 */
typedef enum
{
    IfxCan_FrameType_receive,             /**< \brief Data frame is received */
    IfxCan_FrameType_transmit,            /**< \brief Data frame is generated */
    IfxCan_FrameType_transmitAndReceive,  /**< \brief for both transmit and receive frames */
    IfxCan_FrameType_remoteRequest,       /**< \brief Remote request frame is generated */
    IfxCan_FrameType_remoteAnswer         /**< \brief Answer frame is generated on reception of the corresponding remote request */
} IfxCan_FrameType;

/** \brief Type of interrupt\n
 * Definition in Ifx_CAN.N[x].IE, Ifx_CAN.N[x].IR, Ifx_CAN.N[x].ILS, (x= 0 to 3)
 */
typedef enum
{
    IfxCan_Interrupt_rxFifo0NewMessage,                 /**< \brief Rx FIFO 0 New Message Interrupt */
    IfxCan_Interrupt_rxFifo0WatermarkReached,           /**< \brief Rx FIFO 0 Watermark Reached Interrupt */
    IfxCan_Interrupt_rxFifo0Full,                       /**< \brief Rx FIFO 0 Full Interrupt */
    IfxCan_Interrupt_rxFifo0MessageLost,                /**< \brief Rx FIFO 0 Message Lost Interrupt */
    IfxCan_Interrupt_rxFifo1NewMessage,                 /**< \brief Rx FIFO 1 New Message Interrupt */
    IfxCan_Interrupt_rxFifo1WatermarkReached,           /**< \brief Rx FIFO 1 Watermark Reached Interrupt */
    IfxCan_Interrupt_rxFifo1Full,                       /**< \brief Rx FIFO 1 Full Interrupt */
    IfxCan_Interrupt_rxFifo1MessageLost,                /**< \brief Rx FIFO 1 Message Lost Interrupt */
    IfxCan_Interrupt_highPriorityMessage,               /**< \brief High Priority Message Interrupt */
    IfxCan_Interrupt_transmissionCompleted,             /**< \brief Transmission Completed Interrupt */
    IfxCan_Interrupt_transmissionCancellationFinished,  /**< \brief Transmission Cancellation Finished Interrupt */
    IfxCan_Interrupt_txFifoEmpty,                       /**< \brief Tx FIFO Empty Interrupt */
    IfxCan_Interrupt_txEventFifoNewEntry,               /**< \brief Tx Event FIFO New Entry Interrupt */
    IfxCan_Interrupt_txEventFifoWatermarkReached,       /**< \brief Tx Event FIFO Watermark Reached Interrupt */
    IfxCan_Interrupt_txEventFifoFull,                   /**< \brief Tx Event FIFO Full Interrupt */
    IfxCan_Interrupt_txEventFifoEventLost,              /**< \brief Tx Event FIFO Event Lost Interrupt */
    IfxCan_Interrupt_timestampWraparound,               /**< \brief Timestamp Wraparound Interrupt */
    IfxCan_Interrupt_messageRAMAccessFailure,           /**< \brief Message RAM Access Failure Interrupt */
    IfxCan_Interrupt_timeoutOccurred,                   /**< \brief Timeout Occurred Interrupt */
    IfxCan_Interrupt_messageStoredToDedicatedRxBuffer,  /**< \brief Message stored to Dedicated Rx Buffer Interrupt */
    IfxCan_Interrupt_bitErrorCorrected,                 /**< \brief Bit Error Corrected Interrupt */
    IfxCan_Interrupt_bitErrorUncorrected,               /**< \brief Bit Error Uncorrected Interrupt */
    IfxCan_Interrupt_errorLoggingOverflow,              /**< \brief Error Logging Overflow Interrupt */
    IfxCan_Interrupt_errorPassive,                      /**< \brief Error Passive Interrupt */
    IfxCan_Interrupt_warningStatus,                     /**< \brief Warning Status Interrupt */
    IfxCan_Interrupt_busOffStatus,                      /**< \brief Bus_Off Status Interrupt */
    IfxCan_Interrupt_watchdog,                          /**< \brief Watchdog Interrupt */
    IfxCan_Interrupt_protocolErrorArbitration,          /**< \brief Protocol Error in Arbitration phase Interrupt */
    IfxCan_Interrupt_protocolErrorData,                 /**< \brief Protocol Error in Data phase Interrupt */
    IfxCan_Interrupt_AccessToReservedAddress            /**< \brief Access to Reserved Address Interrupt */
} IfxCan_Interrupt;

/** \brief Type of interrupt\n
 * Definition in Ifx_CAN.GRINT[x] (x= 0 , 1)
 */
typedef enum
{
    IfxCan_InterruptGroup_tefifo,  /**< \brief Transmit Event FIFO Incidents */
    IfxCan_InterruptGroup_hpe,     /**< \brief High Priority Events */
    IfxCan_InterruptGroup_wati,    /**< \brief Watermark interrupts are mapped here. */
    IfxCan_InterruptGroup_alrt,    /**< \brief Alerts */
    IfxCan_InterruptGroup_moer,    /**< \brief Module errors */
    IfxCan_InterruptGroup_safe,    /**< \brief Safety counter overflow */
    IfxCan_InterruptGroup_boff,    /**< \brief Bus Off */
    IfxCan_InterruptGroup_loi,     /**< \brief Last Error Interrupts */
    IfxCan_InterruptGroup_reint,   /**< \brief Message stored in dedicated receive buffer interrupt (IR.DRX) */
    IfxCan_InterruptGroup_rxf1f,   /**< \brief Receive FIFO1 full interrupt */
    IfxCan_InterruptGroup_rxf0f,   /**< \brief Receive FIFO0 full interrupt */
    IfxCan_InterruptGroup_rxf1n,   /**< \brief Receive FIFO1 new message Interrupt */
    IfxCan_InterruptGroup_rxf0n,   /**< \brief Receive FIFO0 new message Interrupt */
    IfxCan_InterruptGroup_reti,    /**< \brief Receive timeouts */
    IfxCan_InterruptGroup_traq,    /**< \brief Transmission Queue Events */
    IfxCan_InterruptGroup_traco    /**< \brief Interrupts of the transmission control */
} IfxCan_InterruptGroup;

