feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \brief Interrupt line number INT_Ox (x= 0 - 15) \n
 */
typedef enum
{
    IfxCan_InterruptLine_0,     /**< \brief Interrupt Line 0  */
    IfxCan_InterruptLine_1,     /**< \brief Interrupt Line 1  */
    IfxCan_InterruptLine_2,     /**< \brief Interrupt Line 2  */
    IfxCan_InterruptLine_3,     /**< \brief Interrupt Line 3  */
    IfxCan_InterruptLine_4,     /**< \brief Interrupt Line 4  */
    IfxCan_InterruptLine_5,     /**< \brief Interrupt Line 5  */
    IfxCan_InterruptLine_6,     /**< \brief Interrupt Line 6  */
    IfxCan_InterruptLine_7,     /**< \brief Interrupt Line 7  */
    IfxCan_InterruptLine_8,     /**< \brief Interrupt Line 8  */
    IfxCan_InterruptLine_9,     /**< \brief Interrupt Line 9  */
    IfxCan_InterruptLine_10,    /**< \brief Interrupt Line 10  */
    IfxCan_InterruptLine_11,    /**< \brief Interrupt Line 11  */
    IfxCan_InterruptLine_12,    /**< \brief Interrupt Line 12  */
    IfxCan_InterruptLine_13,    /**< \brief Interrupt Line 13  */
    IfxCan_InterruptLine_14,    /**< \brief Interrupt Line 14  */
    IfxCan_InterruptLine_15     /**< \brief Interrupt Line 15  */
} IfxCan_InterruptLine;

/** \brief Type of last error to occur on the CAN node
 */
typedef enum
{
    IfxCan_LastErrorCodeType_noError       = 0, /**< \brief No Error occured in the recent CAN message transmission or reception. */
    IfxCan_LastErrorCodeType_stuffError    = 1, /**< \brief More than 5 consecutive equal bits recieved in CAN message */
    IfxCan_LastErrorCodeType_formError     = 2, /**< \brief Fixed format part of recieved frame has wrong format */
    IfxCan_LastErrorCodeType_ackError      = 3, /**< \brief No ACK recieved from another node for transmitted CAN message */
    IfxCan_LastErrorCodeType_bit1Error     = 4, /**< \brief Transmitted recessive and read back dominant on the CAN bus. */
    IfxCan_LastErrorCodeType_bit0Error     = 5, /**< \brief Transmitted dominant and read back recessive on the CAN bus. */
    IfxCan_LastErrorCodeType_crcError      = 6, /**< \brief CRC Error */
    IfxCan_LastErrorCodeType_noCANBusEvent = 7  /**< \brief No CAN bus event occured */
} IfxCan_LastErrorCodeType;

/** \brief Message Id length (Standard / Extended)
 */
typedef enum
{
    IfxCan_MessageIdLength_standard,  /**< \brief Standard Message ID */
    IfxCan_MessageIdLength_extended,  /**< \brief Extended Message ID */
    IfxCan_MessageIdLength_both       /**< \brief Both Standard and Extended message IDs */
} IfxCan_MessageIdLength;

/** \brief Indicate the action to be taken with the messages which do not match with any element of the filter.
 */
typedef enum
{
    IfxCan_NonMatchingFrame_acceptToRxFifo0 = 0,  /**< \brief Accept the non matching messages into Rx FIFO 0 */
    IfxCan_NonMatchingFrame_acceptToRxFifo1 = 1,  /**< \brief Accepts the non matching messages into Rx FIFO 1 */
    IfxCan_NonMatchingFrame_reject          = 2   /**< \brief Reject the non-matching messages */
} IfxCan_NonMatchingFrame;

/** \brief Rx Buffer number
 */
typedef enum
{
    IfxCan_RxBufferId_0,     /**< \brief Rx buffer 0  */
    IfxCan_RxBufferId_1,     /**< \brief Rx buffer 1  */
    IfxCan_RxBufferId_2,     /**< \brief Rx buffer 2  */
    IfxCan_RxBufferId_3,     /**< \brief Rx buffer 3  */
    IfxCan_RxBufferId_4,     /**< \brief Rx buffer 4  */
    IfxCan_RxBufferId_5,     /**< \brief Rx buffer 5  */
    IfxCan_RxBufferId_6,     /**< \brief Rx buffer 6  */
    IfxCan_RxBufferId_7,     /**< \brief Rx buffer 7  */
    IfxCan_RxBufferId_8,     /**< \brief Rx buffer 8  */
    IfxCan_RxBufferId_9,     /**< \brief Rx buffer 9  */
    IfxCan_RxBufferId_10,    /**< \brief Rx buffer 10  */
    IfxCan_RxBufferId_11,    /**< \brief Rx buffer 11  */
    IfxCan_RxBufferId_12,    /**< \brief Rx buffer 12  */
    IfxCan_RxBufferId_13,    /**< \brief Rx buffer 13  */
    IfxCan_RxBufferId_14,    /**< \brief Rx buffer 14  */
    IfxCan_RxBufferId_15,    /**< \brief Rx buffer 15  */
    IfxCan_RxBufferId_16,    /**< \brief Rx buffer 16  */
    IfxCan_RxBufferId_17,    /**< \brief Rx buffer 17  */
    IfxCan_RxBufferId_18,    /**< \brief Rx buffer 18  */
    IfxCan_RxBufferId_19,    /**< \brief Rx buffer 19  */
    IfxCan_RxBufferId_20,    /**< \brief Rx buffer 20  */
    IfxCan_RxBufferId_21,    /**< \brief Rx buffer 21  */
    IfxCan_RxBufferId_22,    /**< \brief Rx buffer 22  */
    IfxCan_RxBufferId_23,    /**< \brief Rx buffer 23  */
    IfxCan_RxBufferId_24,    /**< \brief Rx buffer 24  */
    IfxCan_RxBufferId_25,    /**< \brief Rx buffer 25  */
    IfxCan_RxBufferId_26,    /**< \brief Rx buffer 26  */
    IfxCan_RxBufferId_27,    /**< \brief Rx buffer 27  */
    IfxCan_RxBufferId_28,    /**< \brief Rx buffer 28  */
    IfxCan_RxBufferId_29,    /**< \brief Rx buffer 29  */
    IfxCan_RxBufferId_30,    /**< \brief Rx buffer 30  */
    IfxCan_RxBufferId_31,    /**< \brief Rx buffer 31  */
    IfxCan_RxBufferId_32,    /**< \brief Rx buffer 32  */
    IfxCan_RxBufferId_33,    /**< \brief Rx buffer 33  */
    IfxCan_RxBufferId_34,    /**< \brief Rx buffer 34  */
    IfxCan_RxBufferId_35,    /**< \brief Rx buffer 35  */
    IfxCan_RxBufferId_36,    /**< \brief Rx buffer 36  */
    IfxCan_RxBufferId_37,    /**< \brief Rx buffer 37  */
    IfxCan_RxBufferId_38,    /**< \brief Rx buffer 38  */
    IfxCan_RxBufferId_39,    /**< \brief Rx buffer 39  */
    IfxCan_RxBufferId_40,    /**< \brief Rx buffer 40  */
    IfxCan_RxBufferId_41,    /**< \brief Rx buffer 41  */
    IfxCan_RxBufferId_42,    /**< \brief Rx buffer 42  */
    IfxCan_RxBufferId_43,    /**< \brief Rx buffer 43  */
    IfxCan_RxBufferId_44,    /**< \brief Rx buffer 44  */
    IfxCan_RxBufferId_45,    /**< \brief Rx buffer 45  */
    IfxCan_RxBufferId_46,    /**< \brief Rx buffer 46  */
    IfxCan_RxBufferId_47,    /**< \brief Rx buffer 47  */
    IfxCan_RxBufferId_48,    /**< \brief Rx buffer 48  */
    IfxCan_RxBufferId_49,    /**< \brief Rx buffer 49  */
    IfxCan_RxBufferId_50,    /**< \brief Rx buffer 50  */
    IfxCan_RxBufferId_51,    /**< \brief Rx buffer 51  */
    IfxCan_RxBufferId_52,    /**< \brief Rx buffer 52  */
    IfxCan_RxBufferId_53,    /**< \brief Rx buffer 53  */
    IfxCan_RxBufferId_54,    /**< \brief Rx buffer 54  */
    IfxCan_RxBufferId_55,    /**< \brief Rx buffer 55  */
    IfxCan_RxBufferId_56,    /**< \brief Rx buffer 56  */
    IfxCan_RxBufferId_57,    /**< \brief Rx buffer 57  */
    IfxCan_RxBufferId_58,    /**< \brief Rx buffer 58  */
    IfxCan_RxBufferId_59,    /**< \brief Rx buffer 59  */
    IfxCan_RxBufferId_60,    /**< \brief Rx buffer 60  */
    IfxCan_RxBufferId_61,    /**< \brief Rx buffer 61  */
    IfxCan_RxBufferId_62,    /**< \brief Rx buffer 62  */
    IfxCan_RxBufferId_63     /**< \brief Rx buffer 63  */
} IfxCan_RxBufferId;

/** \brief Rx FIFO 0/1 operating mode\n
 * Description in Ifx_CAN.N[x].RXFyC.FyOM, (x= 0 to 3; y = 0, 1)
 */
typedef enum
{
    IfxCan_RxFifoMode_blocking,  /**< \brief Blocking mode */
    IfxCan_RxFifoMode_overwrite  /**< \brief Overwrite mode */
} IfxCan_RxFifoMode;

