feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \brief Rx Buffers or FIFO 0 or combination Mode of reception
 */
typedef enum
{
    IfxCan_RxMode_dedicatedBuffers,  /**< \brief Rx dedicated buffers operation */
    IfxCan_RxMode_fifo0,             /**< \brief Rx FIFO 0 operation */
    IfxCan_RxMode_fifo1,             /**< \brief Rx FIFO 1 operation */
    IfxCan_RxMode_sharedFifo0,       /**< \brief Rx shared dedicated buffers and Rx FIFO 0 operation */
    IfxCan_RxMode_sharedFifo1,       /**< \brief Rx shared dedicated buffers and Rx FIFO 1 operation */
    IfxCan_RxMode_sharedAll          /**< \brief Rx shared dedicated buffers and Rx FIFO 0 and Rx FIFO 1 operation */
} IfxCan_RxMode;

/** \brief Enable/disable the sensitivity of the module to sleep signal\n
 * Definition in Ifx_CAN.CLC.B.EDIS
 */
typedef enum
{
    IfxCan_SleepMode_enable  = 0, /**< \brief enables sleep mode */
    IfxCan_SleepMode_disable = 1  /**< \brief disables sleep mode */
} IfxCan_SleepMode;

/** \brief CAN API status definition
 */
typedef enum
{
    IfxCan_Status_ok                = 0x00000000,
    IfxCan_Status_notInitialised    = 0x00000001,
    IfxCan_Status_busOff            = 0x00000010,
    IfxCan_Status_notSentBusy       = 0x00000020,
    IfxCan_Status_receiveEmpty      = 0x00000040,
    IfxCan_Status_messageLost       = 0x00000080,
    IfxCan_Status_newData           = 0x00000100,
    IfxCan_Status_newDataButOneLost = 0x00000180
} IfxCan_Status;

/** \brief OCDS Suspend Control (OCDS.SUS)
 */
typedef enum
{
    IfxCan_SuspendMode_none = 0,  /**< \brief No suspend */
    IfxCan_SuspendMode_hard = 1,  /**< \brief Hard Suspend */
    IfxCan_SuspendMode_soft = 2   /**< \brief Soft Suspend */
} IfxCan_SuspendMode;

/** \brief Tx Buffer number
 */
typedef enum
{
    IfxCan_TxBufferId_0,     /**< \brief Tx buffer 0  */
    IfxCan_TxBufferId_1,     /**< \brief Tx buffer 1  */
    IfxCan_TxBufferId_2,     /**< \brief Tx buffer 2  */
    IfxCan_TxBufferId_3,     /**< \brief Tx buffer 3  */
    IfxCan_TxBufferId_4,     /**< \brief Tx buffer 4  */
    IfxCan_TxBufferId_5,     /**< \brief Tx buffer 5  */
    IfxCan_TxBufferId_6,     /**< \brief Tx buffer 6  */
    IfxCan_TxBufferId_7,     /**< \brief Tx buffer 7  */
    IfxCan_TxBufferId_8,     /**< \brief Tx buffer 8  */
    IfxCan_TxBufferId_9,     /**< \brief Tx buffer 9  */
    IfxCan_TxBufferId_10,    /**< \brief Tx buffer 10  */
    IfxCan_TxBufferId_11,    /**< \brief Tx buffer 11  */
    IfxCan_TxBufferId_12,    /**< \brief Tx buffer 12  */
    IfxCan_TxBufferId_13,    /**< \brief Tx buffer 13  */
    IfxCan_TxBufferId_14,    /**< \brief Tx buffer 14  */
    IfxCan_TxBufferId_15,    /**< \brief Tx buffer 15  */
    IfxCan_TxBufferId_16,    /**< \brief Tx buffer 16  */
    IfxCan_TxBufferId_17,    /**< \brief Tx buffer 17  */
    IfxCan_TxBufferId_18,    /**< \brief Tx buffer 18  */
    IfxCan_TxBufferId_19,    /**< \brief Tx buffer 19  */
    IfxCan_TxBufferId_20,    /**< \brief Tx buffer 20  */
    IfxCan_TxBufferId_21,    /**< \brief Tx buffer 21  */
    IfxCan_TxBufferId_22,    /**< \brief Tx buffer 22  */
    IfxCan_TxBufferId_23,    /**< \brief Tx buffer 23  */
    IfxCan_TxBufferId_24,    /**< \brief Tx buffer 24  */
    IfxCan_TxBufferId_25,    /**< \brief Tx buffer 25  */
    IfxCan_TxBufferId_26,    /**< \brief Tx buffer 26  */
    IfxCan_TxBufferId_27,    /**< \brief Tx buffer 27  */
    IfxCan_TxBufferId_28,    /**< \brief Tx buffer 28  */
    IfxCan_TxBufferId_29,    /**< \brief Tx buffer 29  */
    IfxCan_TxBufferId_30,    /**< \brief Tx buffer 30  */
    IfxCan_TxBufferId_31     /**< \brief Tx buffer 31  */
} IfxCan_TxBufferId;

/** \brief Tx FIFO/Queue Mode
 */
typedef enum
{
    IfxCan_TxMode_fifo,              /**< \brief Tx FIFO operation */
    IfxCan_TxMode_queue,             /**< \brief Tx Queue operation */
    IfxCan_TxMode_dedicatedBuffers,  /**< \brief Tx dedicated buffers operation */
    IfxCan_TxMode_sharedFifo,        /**< \brief Tx shared dedicated buffers and Tx FIFO operation */
    IfxCan_TxMode_sharedQueue        /**< \brief Tx shared dedicated buffers and Tx Queue operation */
} IfxCan_TxMode;

/** \} */

/** \brief CAN node Bus Off status
 */
typedef enum
{
    IfxCan_CanNodeBusOffErrorStatus_NoErr     = 0, /**< \brief CAN node not in Bus Off state */
    IfxCan_CanNodeBusOffErrorStatus_BusOffErr = 1  /**< \brief CAN node in Bus Off state */
} IfxCan_CanNodeBusOffErrorStatus;

/** \brief CAN node communication state
 */
typedef enum
{
    IfxCan_CanNodeCommunicationState_synchronize = 0,  /**< \brief CAN node is synchronizing on CAN communication */
    IfxCan_CanNodeCommunicationState_idle        = 1,  /**< \brief Node is neither receiving nor transmitting */
    IfxCan_CanNodeCommunicationState_receive     = 2,  /**< \brief Node is operating as receiver */
    IfxCan_CanNodeCommunicationState_transmit    = 3   /**< \brief Node is operating as transmitter */
} IfxCan_CanNodeCommunicationState;

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

/** \addtogroup IfxLld_Can_Std_Data_Structures
 * \{ */
/** \brief tructure for Filter configuration
 */
typedef struct
{
    uint8                             number;                     /**< \brief Filter Number */
    IfxCan_FilterElementConfiguration elementConfiguration;       /**< \brief *FEC, Filter Element Configuration of (standard / extended ID) filter element */
    IfxCan_FilterType                 type;                       /**< \brief *FT, Filter Type of (standard / extended ID) filter element */
    uint32                            id1;                        /**< \brief *FID1 First ID of (standard / extended ID) filter element */
    uint32                            id2;                        /**< \brief *FID2 Second ID of (standard / extended ID) filter element */
    IfxCan_RxBufferId                 rxBufferOffset;             /**< \brief Rx Buffer number to set the offset to the Rx Buffer Start Address */
} IfxCan_Filter;

/** \brief Configuration for Interrupt groups
 */
typedef struct
{
    IfxCan_InterruptLine interruptLine;       /**< \brief Intterupt line to which this interruipt has to be connetced to */
    Ifx_Priority         priority;            /**< \brief Priority of the interrupt */
    IfxSrc_Tos           typeOfService;       /**< \brief Type of Service */
} IfxCan_GroupInterruptConfig;

/** \brief Structure for CAN Message configuration (transmit/receive)
 */
typedef struct
{
    uint8                  bufferNumber;                /**< \brief (Tx / Rx) Buffer Element number */
    uint32                 messageId;                   /**< \brief ID, Identifier */
    boolean                remoteTransmitRequest;       /**< \brief RTR, Remote Transmit Request (enable / disable) */
    IfxCan_MessageIdLength messageIdLength;             /**< \brief XTD, Message Id length (Standard / Extended) */
    boolean                errorStateIndicator;         /**< \brief ESI, Error State Indicator (enable / disable) */
    IfxCan_DataLengthCode  dataLengthCode;              /**< \brief DLC, Data Length Code */
    IfxCan_FrameMode       frameMode;                   /**< \brief CAN frame mode */
    boolean                txEventFifoControl;          /**< \brief EFC, Tx Event FIFO Control (enable / disable) */
    boolean                storeInTxFifoQueue;          /**< \brief Write message in Tx FIFO/QUEUE */
    boolean                readFromRxFifo0;             /**< \brief Read message from Rx FIFO 0 */
    boolean                readFromRxFifo1;             /**< \brief Read message from Rx FIFO 1 */
} IfxCan_Message;

