feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \brief Structure for Message RAM configuration
 */
typedef struct
{
    uint32 baseAddress;                          /**< \brief Message RAM base address of the CAN */
    uint16 standardFilterListStartAddress;       /**< \brief Start address of Standard Message ID filter list (32-bit word address) */
    uint16 extendedFilterListStartAddress;       /**< \brief Start address of Extended Message ID filter list (32-bit word address) */
    uint16 rxFifo0StartAddress;                  /**< \brief Start address of Rx FIFO 0 in Message RAM (32-bit word address) */
    uint16 rxFifo1StartAddress;                  /**< \brief Start address of Rx FIFO 1 in Message RAM (32-bit word address) */
    uint16 rxBuffersStartAddress;                /**< \brief Start address of Rx Buffers section in the Message RAM (32-bit word address). */
    uint16 txEventFifoStartAddress;              /**< \brief Start address of Tx Event FIFO in Message RAM (32-bit w ord address) */
    uint16 txBuffersStartAddress;                /**< \brief Start address of Tx Buffers section in the Message RAM (32-bit word address). */
} IfxCan_MessageRAM;

/** \} */

/** \addtogroup IfxLld_Can_Std_Node_Functions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disables the configuration change\n
 * The CPU has no write access to the protected configuration registers
 * \param node Specifies the pointer to the CAN Node registers
 * \return None
 */
IFX_INLINE void IfxCan_Node_disableConfigurationChange(Ifx_CAN_N *node);

/** \brief Enables the configuration change\n
 * The CPU has write access to the protected configuration registers (while CCCR.INIT = 1)
 * \param node Specifies the pointer to the CAN Node registers
 * \return None
 */
IFX_INLINE void IfxCan_Node_enableConfigurationChange(Ifx_CAN_N *node);

/** \brief Enables the internal Virtual CAN bus loopback mode
 * \param node Specifies the pointer to the CAN Node registers
 * \return None
 */
IFX_INLINE void IfxCan_Node_enableLoopbackMode(Ifx_CAN_N *node);

/** \brief Returns the status of whether the CAN Node is synchronised or not
 * \param node Specifies the pointer to the CAN Node registers
 * \return Status TRUE: synchronized, FALSE : Sync in progress
 */
IFX_INLINE boolean IfxCan_Node_isNodeSynchronized(Ifx_CAN_N *node);

/** \brief Initialises the node\n
 * 0= Normal Operation\n
 * 1= Initialization is started
 * \param node Specifies the pointer to the CAN Node registers
 * \param enable Enable / Disable choice
 * \return None
 */
IFX_INLINE void IfxCan_Node_setInitialisation(Ifx_CAN_N *node, boolean enable);

/** \brief Sets Transceiver Delay Compensation offset
 * \param node Specifies the pointer to the CAN Node registers
 * \param delay delay offset value
 * \return None
 */
IFX_INLINE void IfxCan_Node_setTransceiverDelayCompensationOffset(Ifx_CAN_N *node, uint8 delay);

/** \brief Get the LEC error status of the CAN node.
 * \param node Specifies the pointer to CAN node registers
 * \return LEC error status in CAN node PSR register
 */
IFX_INLINE IfxCan_LastErrorCodeType IfxCan_Node_getLastErroCodeStatus(Ifx_CAN_N *node);

/** \brief Error Passive status of the CAN node.
 * TRUE: CAN node in error passive.
 * FALSE: CAN node not in error passive.
 * \param node Specifies the pointer to CAN node registers
 * \return Error Passive error status of CAN node (TRUE/FALSE).
 */
IFX_INLINE boolean IfxCan_Node_isErrorPassive(Ifx_CAN_N *node);

/** \brief Get the warning status of the CAN node.
 * \param node Specifies the pointer to CAN node registers
 * \return Warning status in CAN node
 */
IFX_INLINE IfxCan_CanNodeErrorWarningLimitStatus IfxCan_Node_getWarningStatus(Ifx_CAN_N *node);

/** \brief Get the Bus Off status of the CAN node.
 * \param node Specifies the pointer to CAN node registers
 * \return Bus Off Error status in CAN node
 */
IFX_INLINE IfxCan_CanNodeBusOffErrorStatus IfxCan_Node_getBusOffStatus(Ifx_CAN_N *node);

/** \brief Get the Activity status of the CAN node.
 * \param node Specifies the pointer to CAN node registers
 * \return Activity status of CAN node
 */
IFX_INLINE IfxCan_CanNodeCommunicationState IfxCan_Node_getActivityStatus(Ifx_CAN_N *node);

/** \brief Get the Error status in data phase of the CAN node in the recent CANFD operation with bit rate switch.
 * \param node Specifies the pointer to CAN node registers
 * \return Error status of the recent CAN FD with BRS flag set.
 */
IFX_INLINE IfxCan_LastErrorCodeType IfxCan_Node_getDataPhaseLastErrorCode(Ifx_CAN_N *node);

/** \brief Protocol Exception Event status
 * TRUE: Protocol Exception event occured.
 * FALSE: Protocol Exception event not occured.
 * \param node Specifies the pointer to CAN node registers
 * \return Get the Protocol Exception event status (TRUE/FALSE)
 */
IFX_INLINE boolean IfxCan_Node_isProtocolExceptionEventOccured(Ifx_CAN_N *node);

/** \brief Returns the error status of the recent recieved CAN FD message.
 * TRUE : Error status indicator is enabled
 * FALSE: Erro status indicator not enabled.
 * \param node Specifies the pointer to CAN node registers
 * \return Error indicator for recent received CAN FD message (TRUE/FALSE)
 */
IFX_INLINE boolean IfxCan_Node_isErrorStatusIndicatorEnabled(Ifx_CAN_N *node);

/** \brief Bit Rate Switch status of the last recieved CAN FD message.
 * TRUE: Bit rate switch is enabled.
 * FALSE: Bit rate switch is disabled.
 * \param node Specifies the pointer to CAN node registers
 * \return Bit Rate Switch flag status (TRUE/FALSE)
 */
IFX_INLINE boolean IfxCan_Node_isBitRateSwitchFlagEnabled(Ifx_CAN_N *node);

/** \brief Return the DLC code corresponding to the data length in bytes
 * \param dataLength Data length in bytes
 * \return Data length code
 */
IFX_INLINE IfxCan_DataLengthCode IfxCan_Node_getCodeFromDataLengthInBytes(uint32 dataLength);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

