feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \brief Converts data length code (DLC) into number of words
 * \param dataLengthCode DLC, Data Length Code
 * \return Number of data words
 */
IFX_EXTERN uint32 IfxCan_Node_getDataLength(IfxCan_DataLengthCode dataLengthCode);

/** \brief Converts data length code (DLC) into number of data words.
 * This function is deprecated. Use new function IfxCan_Node_getDataLength
 * \param node Specifies the pointer to the CAN Node registers
 * \param dataLengthCode DLC, Data Length Code
 * \return Number of data words
 */
IFX_EXTERN uint32 IfxCan_Node_getDataLengthFromCode(Ifx_CAN_N *node, IfxCan_DataLengthCode dataLengthCode);

/** \brief Returns CAN frame mode of operation for a received frame
 * \param rxBufferElement Rx Buffer Element
 * \return CAN frame mode
 */
IFX_EXTERN IfxCan_FrameMode IfxCan_Node_getFrameMode(Ifx_CAN_RXMSG *rxBufferElement);

/** \brief Select and initialise the CAN node receive pin
 * \param node Specifies the pointer to the CAN Node registers
 * \param rxd Rx pin
 * \param mode Input mode
 * \param padDriver Pad Driver Configuration
 * \return TRUE: Returns TRUE if the operation was successful\n
 * FALSE: Returns FALSE if the operation was errorneous
 */
IFX_EXTERN boolean IfxCan_Node_initRxPin(Ifx_CAN_N *node, IfxCan_Rxd_In *rxd, IfxPort_InputMode mode, IfxPort_PadDriver padDriver);

/** \brief Select and initialise the CAN node transmit pin
 * \param txd Tx pin
 * \param mode Output mode
 * \param padDriver Pad driver Configuration
 * \return TRUE: Returns TRUE if the operation was successful\n
 * FALSE: Returns FALSE if the operation was errorneous
 */
IFX_EXTERN boolean IfxCan_Node_initTxPin(IfxCan_Txd_Out *txd, IfxPort_OutputMode mode, IfxPort_PadDriver padDriver);

/** \brief Calculates and Sets the CAN baudrate for standard frames and arbitration phase of CAND FD frames
 * \param node Specifies the pointer to the CAN Node registers
 * \param moduleFreq Specifies the CAN module frequency
 * \param baudrate Specifies the baud rate. Unit: baud
 * \param samplePoint Specifies the sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \param syncJumpWidth Specifies the re-synchronization jump width
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setBitTiming(Ifx_CAN_N *node, float32 moduleFreq, uint32 baudrate, uint16 samplePoint, uint16 syncJumpWidth);

/** \brief Sets the values of CAN baudrate for standard frames
 * \param node Specifies the pointer to the CAN Node registers
 * \param syncJumpWidth Synchronization Jump Width
 * \param timeSegment2 Time segment after sample point
 * \param timeSegment1 Time segment before sample point
 * \param prescaler Baud Rate Prescaler
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setBitTimingValues(Ifx_CAN_N *node, uint16 syncJumpWidth, uint8 timeSegment2, uint8 timeSegment1, uint16 prescaler);

/** \brief Calulates and Sets the CAN fast baudrate for CAN FD frames data phase
 * \param node Specifies the pointer to the CAN Node registers
 * \param moduleFreq Specifies the CAN module frequency
 * \param baudrate Specifies the baud rate. Unit: baud
 * \param samplePoint Specifies the sample point. Range = [0, 10000] resp. [0%, 100%] of the total bit time.
 * \param syncJumpWidth Specifies the re-synchronization jump width
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setFastBitTiming(Ifx_CAN_N *node, float32 moduleFreq, uint32 baudrate, uint16 samplePoint, uint16 syncJumpWidth);

/** \brief Sets the values of CAN fast baudrate for CAN FD frames data phase
 * \param node Specifies the pointer to the CAN Node registers
 * \param syncJumpWidth Synchronization Jump Width
 * \param timeSegment2 Time segment after sample point
 * \param timeSegment1 Time segment before sample point
 * \param prescaler Baud Rate Prescaler
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setFastBitTimingValues(Ifx_CAN_N *node, uint16 syncJumpWidth, uint8 timeSegment2, uint8 timeSegment1, uint16 prescaler);

/** \brief Enables the CAN frame mode for transmission
 * \param node Specifies the pointer to the CAN Node registers
 * \param frameMode CAN frame mode
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setFrameMode(Ifx_CAN_N *node, IfxCan_FrameMode frameMode);

/** \brief Sets CAN frame mode request for transmission
 * \param txBufferElement Tx Buffer Element
 * \param frameMode CAN frame mode
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setFrameModeReq(Ifx_CAN_TXMSG *txBufferElement, IfxCan_FrameMode frameMode);

/** \brief Sets CAN frame mode request for transmission.
 * This function is deprecated. Use new function IfxCan_Node_setFrameModeReq
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferElement Tx Buffer Element
 * \param frameMode CAN frame mode
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setFrameModeRequest(Ifx_CAN_N *node, Ifx_CAN_TXMSG *txBufferElement, IfxCan_FrameMode frameMode);

/** \brief Converts data length code (DLC) into number of bytes
 * \param dataLengthCode Data length code
 * \return Data length in bytes
 */
IFX_EXTERN uint32 IfxCan_Node_getDataLengthInBytes(IfxCan_DataLengthCode dataLengthCode);

/** \} */

/** \addtogroup IfxLld_Can_Std_Tx_Element_Functions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns Tx FIFO/Queue Put Index
 * \param node Specifies the pointer to the CAN Node registers
 * \return Tx Buffer Element Number
 */
IFX_INLINE IfxCan_TxBufferId IfxCan_Node_getTxFifoQueuePutIndex(Ifx_CAN_N *node);

/** \brief Returns the status of whether cancellation is finished on the selected Tx buffer
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferId Tx Buffer number
 * \return Status
 */
IFX_INLINE boolean IfxCan_Node_isTxBufferCancellationFinished(Ifx_CAN_N *node, IfxCan_TxBufferId txBufferId);

/** \brief Returns the status of pending request of the selected Tx buffer
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferId Tx Buffer number
 * \return Status
 */
IFX_INLINE boolean IfxCan_Node_isTxBufferRequestPending(Ifx_CAN_N *node, IfxCan_TxBufferId txBufferId);

/** \brief Returns the status of whether transmission occured on the selected Tx buffer
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferId Tx Buffer number
 * \return Status
 */
IFX_INLINE boolean IfxCan_Node_isTxBufferTransmissionOccured(Ifx_CAN_N *node, IfxCan_TxBufferId txBufferId);

/** \brief Returns the status of Tx Fifo/Queue is full or not
 * \param node Specifies the pointer to the CAN Node registers
 * \return Status
 */
IFX_INLINE boolean IfxCan_Node_isTxFifoQueueFull(Ifx_CAN_N *node);

/** \brief pauses the CAN Node for two CAN bit times before starting the next transmission
 * \param node Specifies the pointer to the CAN Node registers
 * \param enable Enable / Disable choice
 * \return None
 */
IFX_INLINE void IfxCan_Node_pauseTransmission(Ifx_CAN_N *node, boolean enable);

/** \brief Sets the Data Length Code (DLC) for transmit frame
 * \param txBufferElement Tx Buffer Element
 * \param dataLengthCode DLC, data length code
 * \return None
 */
IFX_INLINE void IfxCan_Node_setDataLength(Ifx_CAN_TXMSG *txBufferElement, IfxCan_DataLengthCode dataLengthCode);

