feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \brief Returns Rx FIFO 1 Data Field Size in bytes
 * \param node Specifies the pointer to the CAN Node registers
 * \return Data field size
 */
IFX_EXTERN uint8 IfxCan_Node_getRxFifo1DataFieldSize(Ifx_CAN_N *node);

/** \brief Returns the address of selected Rx FIFO 1 element
 * \param node Specifies the pointer to the CAN Node registers
 * \param ramBaseAddress Message RAM base address of CAN Module
 * \param rxFifo1StartAddress Start address of Rx FIFO 1 section in the Message RAM
 * \param rxBufferNumber Rx buffer element number
 * \return Rx FIFO 1 Element Address
 */
IFX_EXTERN Ifx_CAN_RXMSG *IfxCan_Node_getRxFifo1ElementAddress(Ifx_CAN_N *node, uint32 ramBaseAddress, uint16 rxFifo1StartAddress, IfxCan_RxBufferId rxBufferNumber);

/** \brief Returns the status of whether the selcted Rx buffer has been updated from new data
 * \param node Specifies the pointer to the CAN Node registers
 * \param rxBufferId Rx Buffer number
 * \return Status
 */
IFX_EXTERN boolean IfxCan_Node_isRxBufferNewDataUpdated(Ifx_CAN_N *node, IfxCan_RxBufferId rxBufferId);

/** \brief Reads data from Rx buffer element
 * \param rxBufferElement Rx Buffer Element
 * \param dataLengthCode DLC, Data Length Code
 * \param data Pointer to data (in words)
 * \return None
 */
IFX_EXTERN void IfxCan_Node_readData(Ifx_CAN_RXMSG *rxBufferElement, IfxCan_DataLengthCode dataLengthCode, uint32 *data);

/** \} */

/** \addtogroup IfxLld_Can_Std_Filter_Functions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disables the selected interrupt
 * \param node Specifies the pointer to the CAN Node registers
 * \return None
 */
IFX_INLINE void IfxCan_Node_acceptRemoteFramesWithStandardId(Ifx_CAN_N *node);

/** \brief Disables the selected interrupt
 * \param node Specifies the pointer to the CAN Node registers
 * \return None
 */
IFX_INLINE void IfxCan_Node_acceptRemoteFrameswithExtendedId(Ifx_CAN_N *node);

/** \brief Configure the filter for non matching frames with extended id.
 * \param node Specifies the pointer to the CAN Node registers
 * \param filter action to be performed on non matching messages.
 * \return None
 */
IFX_INLINE void IfxCan_Node_configureExtendedFilterForNonMatchingFrames(Ifx_CAN_N *node, IfxCan_NonMatchingFrame filter);

/** \brief Configure the filter for non matching frames with standard id.
 * \param node Specifies the pointer to the CAN Node registers
 * \param filter action to be performed on non matching messages.
 * \return None
 */
IFX_INLINE void IfxCan_Node_configureStandardFilterForNonMatchingFrames(Ifx_CAN_N *node, IfxCan_NonMatchingFrame filter);

/** \brief Reject the remote frames with extended id.
 * \param node Specifies the pointer to the CAN Node registers
 * \return None
 */
IFX_INLINE void IfxCan_Node_rejectRemoteFramesWithExtendedId(Ifx_CAN_N *node);

/** \brief Reject the remote frames with standard id.
 * \param node Specifies the pointer to the CAN Node registers
 * \return None
 */
IFX_INLINE void IfxCan_Node_rejectRemoteFramesWithStandardId(Ifx_CAN_N *node);

/** \brief Sets the Extended Filter Element Configuration
 * \param extendedFilterElement Extended Filter Element
 * \param filterElementConfiguration Filter Element Configuration
 * \return None
 */
IFX_INLINE void IfxCan_Node_setExtendedFilterConfiguration(Ifx_CAN_EXTMSG *extendedFilterElement, IfxCan_FilterElementConfiguration filterElementConfiguration);

/** \brief Sets the Extended Filter ID 1 for Extended Filter Element
 * \param extendedFilterElement Extended Filter Element
 * \param id Filter ID 1
 * \return None
 */
IFX_INLINE void IfxCan_Node_setExtendedFilterId1(Ifx_CAN_EXTMSG *extendedFilterElement, uint32 id);

/** \brief Sets the Extended Filter ID 2 for Extended Filter Element
 * \param extendedFilterElement Extended Filter Element
 * \param id Filter ID 2
 * \return None
 */
IFX_INLINE void IfxCan_Node_setExtendedFilterId2(Ifx_CAN_EXTMSG *extendedFilterElement, uint32 id);

/** \brief Sets the Extended Message ID filter list size
 * \param node Specifies the pointer to the CAN Node registers
 * \param size Number of Extended Message ID filter elements
 * \return None
 */
IFX_INLINE void IfxCan_Node_setExtendedFilterListSize(Ifx_CAN_N *node, uint8 size);

/** \brief Sets the start address of Extended Message ID filter list (32-bit word address)
 * \param node Specifies the pointer to the CAN Node registers
 * \param address Start address of Extended Message ID filter list in the Message RAM
 * \return None
 */
IFX_INLINE void IfxCan_Node_setExtendedFilterListStartAddress(Ifx_CAN_N *node, uint16 address);

/** \brief Sets the Offset to the Rx Buffer Start Address RXBC.RBSA for storage of a matching message for Extended filter element
 * \param extendedFilterElement Extended Filter Element
 * \param rxBufferNumber Offset to the Rx Buffer Start Address RXBC.RBSA for storage of a matching message (Rx buffer number)
 * \return None
 */
IFX_INLINE void IfxCan_Node_setExtendedFilterRxBufferOffset(Ifx_CAN_EXTMSG *extendedFilterElement, IfxCan_RxBufferId rxBufferNumber);

/** \brief Sets the Extended Filter Type for Extended Filter Element
 * \param extendedFilterElement Extended Filter Element
 * \param filterType Filter Type
 * \return None
 */
IFX_INLINE void IfxCan_Node_setExtendedFilterType(Ifx_CAN_EXTMSG *extendedFilterElement, IfxCan_FilterType filterType);

/** \brief Sets the Standard Filter Element Configuration
 * \param standardFilterElement Standard Filter Element
 * \param filterElementConfiguration Filter Element Configuration
 * \return None
 */
IFX_INLINE void IfxCan_Node_setStandardFilterConfiguration(Ifx_CAN_STDMSG *standardFilterElement, IfxCan_FilterElementConfiguration filterElementConfiguration);

/** \brief Sets the Standard Filter ID 1 for Standard Filter Element
 * \param standardFilterElement Standard Filter Element
 * \param id Filter ID 1
 * \return None
 */
IFX_INLINE void IfxCan_Node_setStandardFilterId1(Ifx_CAN_STDMSG *standardFilterElement, uint32 id);

/** \brief Sets the Standard Filter ID 2 for Standard Filter Element
 * \param standardFilterElement Standard Filter Element
 * \param id Filter ID 2
 * \return None
 */
IFX_INLINE void IfxCan_Node_setStandardFilterId2(Ifx_CAN_STDMSG *standardFilterElement, uint32 id);

/** \brief Sets the Standard  Message ID filter list size
 * \param node Specifies the pointer to the CAN Node registers
 * \param size Number of Standard Message ID filter elements
 * \return None
 */
IFX_INLINE void IfxCan_Node_setStandardFilterListSize(Ifx_CAN_N *node, uint8 size);

/** \brief Sets the start address of Standard Message ID filter list (32-bit word address)
 * \param node Specifies the pointer to the CAN Node registers
 * \param address Start address of Standard Message ID filter in the Message RAM
 * \return None
 */
IFX_INLINE void IfxCan_Node_setStandardFilterListStartAddress(Ifx_CAN_N *node, uint16 address);

/** \brief Sets the Offset to the Rx Buffer Start Address RXBC.RBSA for storage of a matching message for standard filter element
 * \param standardFilterElement Standard Filter Element
 * \param rxBufferNumber Offset to the Rx Buffer Start Address RXBC.RBSA for storage of a matching message (Rx buffer number)
 * \return None
 */
IFX_INLINE void IfxCan_Node_setStandardFilterRxBufferOffset(Ifx_CAN_STDMSG *standardFilterElement, IfxCan_RxBufferId rxBufferNumber);

/** \brief Sets the Standard Filter Type for Standard Filter Element
 * \param standardFilterElement Standard Filter Element
 * \param filterType Filter Type
 * \return None
 */
IFX_INLINE void IfxCan_Node_setStandardFilterType(Ifx_CAN_STDMSG *standardFilterElement, IfxCan_FilterType filterType);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the address of selected extended filter element
 * \param ramBaseAddress Message RAM base address of CAN Module
 * \param extendedFilterListStartAddress Start address of Extended Message ID filter list (32-bit word address)
 * \param filterNumber extended filter element number
 * \return Extended Filter Element Address
 */
IFX_EXTERN Ifx_CAN_EXTMSG *IfxCan_Node_getExtendedFilterElementAddress(uint32 ramBaseAddress, uint16 extendedFilterListStartAddress, uint8 filterNumber);

