feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \brief Returns the address of selected standard filter element
 * \param ramBaseAddress Message RAM base address of CAN Module
 * \param standardFilterListStartAddress Start address of Standard Message ID filter list (32-bit word address)
 * \param filterNumber Standard filter element number
 * \return Standard Filter Element Address
 */
IFX_EXTERN Ifx_CAN_STDMSG *IfxCan_Node_getStandardFilterElementAddress(uint32 ramBaseAddress, uint16 standardFilterListStartAddress, uint8 filterNumber);

/** \} */

/** \addtogroup IfxLld_Can_Std_Interrupt_Functions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Clears the selected interrupt Flag
 * \param node Specifies the pointer to the CAN Node registers
 * \param interrupt Type of Interrupt
 * \return None
 */
IFX_INLINE void IfxCan_Node_clearInterruptFlag(Ifx_CAN_N *node, IfxCan_Interrupt interrupt);

/** \brief Disables the selected interrupt
 * \param node Specifies the pointer to the CAN Node registers
 * \param interrupt Type of Interrupt
 * \return None
 */
IFX_INLINE void IfxCan_Node_disableInterrupt(Ifx_CAN_N *node, IfxCan_Interrupt interrupt);

/** \brief Disables the Cancellation Finished Interrupt of the selected Tx buffer
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferId Tx Buffer number
 * \return None
 */
IFX_INLINE void IfxCan_Node_disableTxBufferCancellationFinishedInterrupt(Ifx_CAN_N *node, IfxCan_TxBufferId txBufferId);

/** \brief Disables the Transmission Interrupt of the selected Tx buffer
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferId Tx Buffer number
 * \return None
 */
IFX_INLINE void IfxCan_Node_disableTxBufferTransmissionInterrupt(Ifx_CAN_N *node, IfxCan_TxBufferId txBufferId);

/** \brief Enables the selected interrupt
 * \param node Specifies the pointer to the CAN Node registers
 * \param interrupt Type of Interrupt
 * \return None
 */
IFX_INLINE void IfxCan_Node_enableInterrupt(Ifx_CAN_N *node, IfxCan_Interrupt interrupt);

/** \brief Enables the Cancellation Finished Interrupt of the selected Tx buffer
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferId Tx Buffer number
 * \return None
 */
IFX_INLINE void IfxCan_Node_enableTxBufferCancellationFinishedInterrupt(Ifx_CAN_N *node, IfxCan_TxBufferId txBufferId);

/** \brief Enables the Transmission Interrupt of the selected Tx buffer
 * \param node Specifies the pointer to the CAN Node registers
 * \param txBufferId Tx Buffer number
 * \return None
 */
IFX_INLINE void IfxCan_Node_enableTxBufferTransmissionInterrupt(Ifx_CAN_N *node, IfxCan_TxBufferId txBufferId);

/** \brief Returns the status of selected interrupt flag
 * \param node Specifies the pointer to the CAN Node registers
 * \param interrupt Type of Interrupt
 * \return Status TRUE / FALSE
 */
IFX_INLINE boolean IfxCan_Node_getInterruptFlagStatus(Ifx_CAN_N *node, IfxCan_Interrupt interrupt);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Sets the slected interrupt to the selcted interrupt line
 * \param node Specifies the pointer to the CAN Node registers
 * \param interruptGroup Type of Interrupt group
 * \param interruptLine Interrupt line number
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setGroupInterruptLine(Ifx_CAN_N *node, IfxCan_InterruptGroup interruptGroup, IfxCan_InterruptLine interruptLine);

/** \brief Sets the slected interrupt to the selcted interrupt line
 * \param node Specifies the pointer to the CAN Node registers
 * \param interrupt Type of Interrupt
 * \param interruptLine Interrupt line number
 * \return None
 */
IFX_EXTERN void IfxCan_Node_setInterruptLine(Ifx_CAN_N *node, IfxCan_Interrupt interrupt, IfxCan_InterruptLine interruptLine);

/** \} */

/** \addtogroup IfxLld_Can_Std_Module_Functions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the base adress of the selected Node of CAN module
 * \param can Specifies the pointer to the CAN registers
 * \param nodeId Node number of the module
 * \return Specifies the pointer to the CAN Node registers
 */
IFX_INLINE Ifx_CAN_N *IfxCan_getNodePointer(Ifx_CAN *can, IfxCan_NodeId nodeId);

/** \brief Returns the status of module enabled or disabled
 * \param can Specifies the pointer to the CAN registers
 * \return Status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxCan_isModuleEnabled(Ifx_CAN *can);

/** \brief Returns the module's suspend state.
 * TRUE :if module is suspended.
 * FALSE:if module is not yet suspended.
 * \param can Pointer to CAN module registers
 * \return Suspend status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxCan_isModuleSuspended(Ifx_CAN *can);

/** \brief Sets the sensitivity of the module to sleep signal
 * \param can pointer to CAN registers
 * \param mode mode selection (enable/disable)
 * \return None
 */
IFX_INLINE void IfxCan_setSleepMode(Ifx_CAN *can, IfxCan_SleepMode mode);

/** \brief Set the Module to Hard/Soft suspend mode.
 * Note: The api works only when the OCDS is enabled and in Supervisor Mode. When OCDS is disabled the OCS suspend control is ineffective.
 * \param can Pointer to CAN module registers
 * \param mode Module suspend mode
 * \return None
 */
IFX_INLINE void IfxCan_setSuspendMode(Ifx_CAN *can, IfxCan_SuspendMode mode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disables the module (sets the disable request)
 * \param can Specifies the pointer to the CAN registers
 * \return None
 */
IFX_EXTERN void IfxCan_disableModule(Ifx_CAN *can);

/** \brief Enables the module (clears the disable request)
 * \param can Specifies the pointer to the CAN registers
 * \return None
 */
IFX_EXTERN void IfxCan_enableModule(Ifx_CAN *can);

/**
 * \param can Module index of the CAN
 * \return CAN module register address
 */
IFX_EXTERN Ifx_CAN *IfxCan_getAddress(IfxCan_Index can);

/** \brief API to get the resource index of the CAN specified.
 * \return can resource index
 */
IFX_EXTERN IfxCan_Index IfxCan_getIndex(Ifx_CAN *can);

/** \brief Returns the operatinf frequency of the CAN module
 * \return Module Frequency
 */
IFX_EXTERN float32 IfxCan_getModuleFrequency(void);

/** \brief resets CAN kernel
 * \param can pointer to CAN registers
 * \return None
 */
IFX_EXTERN void IfxCan_resetModule(Ifx_CAN *can);

/** \brief sets the clocksource selection
 * \param can Specifies the pointer to the CAN registers
 * \param clockSelect Clock selection option
 * \param clockSource Type of Clock Source selection
 * \return None
 */
IFX_EXTERN void IfxCan_setClockSource(Ifx_CAN *can, IfxCan_ClockSelect clockSelect, IfxCan_ClockSource clockSource);

