feaser/openblt/stm32u5_port/Target/Demo/TRICORE_TC3_TC375_Lite_Kit_ADS/Boot/Libraries/iLLD/TC37A/Tricore/Can/Std/IfxCan.h
/** \} */

/** \addtogroup IfxLld_Can_Std_Tx_Event_FIFO_Element_Functions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the Bit Rate Switch (BRS) from the Tx Event Fifo element
 * \param txEventFifoElement Tx Event FIFO Element
 * \return Bit Rate Switch (TRUE/FALSE)
 */
IFX_INLINE boolean IfxCan_Node_getBRSFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the Data Length Code from the Tx Event Fifo Element
 * \param txEventFifoElement Tx Event Fifo Element
 * \return Data Length Code
 */
IFX_INLINE uint32 IfxCan_Node_getDLCFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the Error State Indicator (ESI) from the Tx Event Fifo element
 * \param txEventFifoElement Tx Event FIFO Element
 * \return Error State Indicator
 */
IFX_INLINE boolean IfxCan_Node_getESIFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the FD Format (FDF) from the Tx Event Fifo element
 * \param txEventFifoElement Tx Event FIFO Element
 * \return FD format (TRUE/FALSE)
 */
IFX_INLINE boolean IfxCan_Node_getFDFFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the Message Marker (MM) from the Tx Event Fifo element
 * \param txEventFifoElement Tx Event FIFO Element
 * \return Message Marker
 */
IFX_INLINE uint8 IfxCan_Node_getMMFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the identifier (ID) from the Tx Event Fifo element
 * \param txEventFifoElement Tx Event FIFO Element
 * \return Identifier
 */
IFX_INLINE uint32 IfxCan_Node_getMesssageIdFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the Remote Transmission Request Status (RTR) from the Tx Event Fifo element
 * \param txEventFifoElement Tx Event FIFO Element
 * \return Remote Transmission Request Status
 */
IFX_INLINE boolean IfxCan_Node_getRTRFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the Tx Time Stamp (TXTS) from the Tx Event Fifo element
 * \param txEventFifoElement Tx Event FIFO Element
 * \return Tx Time Stamp
 */
IFX_INLINE uint16 IfxCan_Node_getTXTSFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the Tx Event Fifo Acknowledge Index
 * \param node Specifies the pointer to the CAN Node registers
 * \return Returns Tx Event Fifo Acknowledge Index
 */
IFX_INLINE uint8 IfxCan_Node_getTxEventFifoAcknowledgeIndex(Ifx_CAN_N *node);

/** \brief Returns the Tx Event Fifo Fill Level
 * \param node Specifies the pointer to the CAN Node registers
 * \return Returns Tx Event Fifo Fill Level
 */
IFX_INLINE uint8 IfxCan_Node_getTxEventFifoFillLevel(Ifx_CAN_N *node);

/** \brief Returns the Tx Event Fifo Get Index
 * \param node Specifies the pointer to the CAN Node registers
 * \return Returns Tx Event Fifo Get Index
 */
IFX_INLINE uint8 IfxCan_Node_getTxEventFifoGetIndex(Ifx_CAN_N *node);

/** \brief Returns the Tx Event Fifo Put Index
 * \param node Specifies the pointer to the CAN Node registers
 * \return Returns Tx Event Fifo Put Index
 */
IFX_INLINE uint8 IfxCan_Node_getTxEventFifoPutIndex(Ifx_CAN_N *node);

/** \brief Returns Tx Event Fifo Size
 * \param node Specifies the pointer to the CAN Node registers
 * \return Tx Event Fifo Size
 */
IFX_INLINE uint8 IfxCan_Node_getTxEventFifoSize(Ifx_CAN_N *node);

/** \brief Returns Tx Event Fifo Start Address
 * \param node Specifies the pointer to the CAN Node registers
 * \return Tx Event Fifo Start Address
 */
IFX_INLINE uint16 IfxCan_Node_getTxEventFifoStartAddress(Ifx_CAN_N *node);

/** \brief Returns Tx Event Fifo Watermark Level
 * \param node Specifies the pointer to the CAN Node registers
 * \return Tx Event Fifo Watermark Level
 */
IFX_INLINE uint8 IfxCan_Node_getTxEventFifoWatermarkLevel(Ifx_CAN_N *node);

/** \brief Returns the status of Tx Event Fifo Element lost
 * \param node Specifies the pointer to the CAN Node registers
 * \return Returns status of Tx Event Fifo Element Lost\n
 * True : elemnt lost\n
 * False : element not lost
 */
IFX_INLINE boolean IfxCan_Node_isTxEventFifoElementLost(Ifx_CAN_N *node);

/** \brief Returns the status of Tx Event Fifo Full
 * \param node Specifies the pointer to the CAN Node registers
 * \return Returns status of Tx Event Fifo Full\n
 * True : Fifo full\n
 * False : Fifo not full
 */
IFX_INLINE boolean IfxCan_Node_isTxEventFifoFull(Ifx_CAN_N *node);

/** \brief Sets Tx Event Fifo Size
 * \param node Specifies the pointer to the CAN Node registers
 * \param size Tx Event Fifo Size
 * \return None
 */
IFX_INLINE void IfxCan_Node_setTxEventFifoSize(Ifx_CAN_N *node, uint8 size);

/** \brief Sets Tx Event Fifo Start Address
 * \param node Specifies the pointer to the CAN Node registers
 * \param address Tx Event Fifo Start Address
 * \return None
 */
IFX_INLINE void IfxCan_Node_setTxEventFifoStartAddress(Ifx_CAN_N *node, uint16 address);

/** \brief Sets Tx Event Fifo Watermark Level
 * \param node Specifies the pointer to the CAN Node registers
 * \param level Tx Event Fifo Watermark Level
 * \return None
 */
IFX_INLINE void IfxCan_Node_setTxEventFifoWatermarkLevel(Ifx_CAN_N *node, uint8 level);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns CAN frame mode of operation for a Tx Event Fifo Element
 * \param txEventFifoElement Tx Event Fifo Element
 * \return CAN frame mode
 */
IFX_EXTERN IfxCan_FrameMode IfxCan_Node_getFrameModeFromTxEventFifo(Ifx_CAN_TXEVENT *txEventFifoElement);

/** \brief Returns the address of selected Tx Event Fifo element
 * \param ramBaseAddress Message RAM base address of CAN module
 * \param txEventFifoStartAddress Start address of Tx Event Fifo section in the Message RAM
 * \param txEventFifoNumber Tx Event Fifo element number
 * \return Tx Event Fifo Element Address
 */
IFX_EXTERN Ifx_CAN_TXEVENT *IfxCan_Node_getTxEventFifoElementAddress(uint32 ramBaseAddress, uint16 txEventFifoStartAddress, uint8 txEventFifoNumber);

